"""Сумма трёх чисел
Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке."""

first_number, second_number, third_number = int(input()), int(input()), int(input())
print(first_number + second_number + third_number)