"""Расстояние в метрах
Напишите программу, которая находит полное число метров по заданному числу сантиметров."""

centimetre = int(input())
print(centimetre // 100)