"""Звёздный прямоугольник
Напишите программу, которая выводит прямоугольник, по периметру состоящий из звёздочек (*).

Примечание. Высота и ширина прямоугольника равны 4 и 17 звёздочкам соответственно."""

first_line = '*****************'
second_line = '*               *'
print(first_line, second_line, second_line, first_line, sep='\n')