"""Четное или нечетное?
Напишите программу, которая определяет, является число четным или нечетным."""

number = int(input())

if number % 2 == 0:
    print('Четное')
else:
    print('Нечетное')