"""Строковые минимум и максимум
На вход программе подаётся последовательность строк, каждая строка на отдельной строке. Концом последовательности является слово «КОНЕЦ» (без кавычек). При этом само слово «КОНЕЦ» не входит в последовательность, лишь символизируя ее окончание. Напишите программу, которая находит в данной последовательности максимальную и минимальную строки (в лексикографическом порядке) и выводит их в следующем формате:

Минимальная строка ⬇️: <минимальная строка>
Максимальная строка ⬆️: <максимальная строка>
Формат входных данных
На вход программе подаётся последовательность строк, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. Не только у чисел мы можем находить максимум и минимум. 🤪"""

word = input()
word_list = []
word_list.append(word)

while word != 'КОНЕЦ':
    word = input()
    word_list.append(word)

del word_list[-1] # Удаляем слово КОНЕЦ из списка
word_list.sort()

print('Минимальная строка ⬇️:', word_list[0])
print('Максимальная строка ⬆️:', word_list[-1])