"""Повторяй за мной 2 🔁
Напишите программу, которая принимает через стандартный поток ввода (команда input()) три строки, а затем выводит их в обратной последовательности, каждую на отдельной строке."""

first_line = input('')
second_line = input('')
third_line = input('')
print(third_line)
print(second_line)
print(first_line)