"""Повторяй за мной 🔁
Напишите программу, которая принимает через стандартный поток ввода (команда input()) три строки, а затем выводит их в той же последовательности, каждую на отдельной строке."""

first_line = input('')
second_line = input('')
third_line = input('')
print(first_line)
print(second_line)
print(third_line)