"""sWAP cASE 🔃
На вход программе подаётся строка. Напишите программу, которая меняет регистр символов – заменяет все строчные символы заглавными и наоборот.

Формат входных данных
На вход программе подаётся строка.

Формат выходных данных
Программа должна вывести строку в соответствии с условием задачи."""

line = input()
print(line.swapcase())