"""Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и круглые. Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты и соответствующие параметры, которая бы выводила площадь получившейся комнаты.
Для числа π в стране Малевии используют значение 3.14.

Формат ввода, который используют Малевийцы:

треугольник
a
b
c
где a, b и c — длины сторон треугольника

прямоугольник
a
b
где a и b — длины сторон прямоугольника

круг
r
где r — радиус окружности"""

PI = 3.14
shape_room = input()

if shape_room == 'треугольник': #Площадь треугольника
    a, b, c = int(input()), int(input()), int(input())
    p = (a + b + c) / 2
    s = (p * (p - a) * (p - b) * (p - c)) ** 0.5
    print(s)

elif shape_room == 'прямоугольник': #Площадь прямоугольника
    a, b = int(input()), int(input())
    print(a * b)

elif shape_room == 'круг': #Площадь круга
    r = int(input())
    print(PI * r ** 2)