"""Упорядоченные цифры 🌶️
Дано натуральное число. Напишите программу, которая определяет, является ли последовательность его цифр при просмотре справа налево упорядоченной по неубыванию.

Формат входных данных
На вход программе подаётся одно натуральное число.

Формат выходных данных
Программа должна вывести «YES» (без кавычек), если последовательность его цифр при просмотре справа налево является упорядоченной по неубыванию, или «NO» (без кавычек) в противном случае."""

number = int(input())
flag = "YES"
last_digit = number % 10

while number > 0:
    if last_digit > number % 10:
        flag = "NO"

    last_digit = number % 10
    number //= 10

print(flag)