'''Напишите программу, которая выводит текст:

"Python is a great language!", said Fred. "I don't ever remember having this much fun before."
Примечание. Используйте конкатенацию строк.'''

line_one = '"Python is a great language!", said Fred. "I don'
line_two = "'"
line_three = 't ever remember having this much fun before."'

print(line_one + line_two + line_three)