"""Автомобильный номер 🚘🌶️
В службе по дорожному движению решили оптимизировать процесс создания автомобильных номеров: вместо человека генерацию автомобильных номеров поручили некоторой GPT (модели машинного обучения). Как мы знаем, искусственный интеллект ещё сыроват и делает много ошибок, поэтому его результаты следует тщательно проверять. Корректный автомобильный номер (в России) имеет следующий формат:

Напишите программу, которая принимает на вход строку и проверяет, является ли эта строка корректным автомобильным номером. Программа должна вывести «YES» (без кавычек), если искусственный интеллект справился со своей задачей, или «NO» (без кавычек) в противном случае. В нашей задаче корректным автомобильным номером будем считать следующие форматы:

<БУКВА><ЦИФРА><ЦИФРА><ЦИФРА><БУКВА><БУКВА>_<ЦИФРА><ЦИФРА>
<БУКВА><ЦИФРА><ЦИФРА><ЦИФРА><БУКВА><БУКВА>_<ЦИФРА><ЦИФРА><ЦИФРА>
где <ЦИФРА> – это любая цифра, а <БУКВА> – это одна из букв кириллицы АВЕКМНОРСТУХ.

Формат входных данных
На вход программе подаётся одна строка – сгенерированный ИИ автомобильный номер.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. Подробнее почитать про автомобильные номера можно по ссылке."""

line = input()
flag = 'NO'
correct_letters = 'АВЕКМНОРСТУХ'

if 9 <= len(line) <= 10:
    letters = line[0] + line[4:6]
    digits = line[1:4] + line[7:]
    underscore = line[6]

    if digits.isdigit() and underscore == '_':
        flag = 'YES'

    for s in letters:
        if s not in correct_letters:
            flag = 'NO'
            break

print(flag)