"""Замени меня полностью 🔄
На вход программе подаётся строка текста. Напишите программу, которая заменяет все вхождения цифры 1 на слово «one».

Формат входных данных 
На вход программе подаётся строка текста.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи."""

line = input()
print(line.replace('1', 'one'))